app/Controllers/TaskController.php

    public function index()
    {
        $model = new TaskModel();
        $data['tasks'] = $model->findAll();
---
SELECT *
FROM `tasks`